/**
 * Задача 5
 *
 * Какое наименьшее число n можно представить в виде произведения n = a∙b ровно
 * k способами? Произведения a∙b и b∙a считаются одним способом, все числа
 * натуральные (1 ≤ k ≤ 50).
 *
 * Технические условия
 *   Входные данные
 *     Единственное число - значение k.
 *   Выходные данные
 *     Единственное число – значение n.
 */

#include <iostream>

int main() {
	const char *s[] = { "-1", "1", "4", "12", "24", "36", "60", "192", "120",
			"180", "240", "576", "360", "1296", "900", "720", "840", "9216",
			"1260", "786432", "1680", "2880", "15360", "3600", "2520", "6480",
			"61440", "6300", "6720", "2359296", "5040", "3221225472", "7560",
			"46080", "983040", "25920", "10080", "206158430208", "32400",
			"184320", "15120", "44100", "20160", "5308416", "107520", "25200",
			"2985984", "9663676416", "27720", "233280", "45360" };

	int k;
	std::cin >> k;
	std::cout << s[k] << std::endl;

	return 0;
}
